<?php

namespace Database\Seeders;

use App\Models\Receipts;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class ReceiptsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('receipts')->delete();
        $receipts = [
            [
                'receiptID' => '1013',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1013'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-01-08',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΙΑΝΟΥΑΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-01-08 19:00:00'

            ],
            [
                'receiptID' => '1014',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1014'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-02-01',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΦΕΒΡΟΥΑΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-02-01 19:00:00'

            ],
            [
                'receiptID' => '1015',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1015'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-03-01',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΜΑΡΤΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-03-02 19:00:00'

            ],
            [
                'receiptID' => '1016',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1016'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-04-02',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΑΠΡΙΛΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-04-02 19:00:00'

            ],
            [
                'receiptID' => '1017',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1017'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-05-03',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΜΑΪΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-05-03 19:00:00'

            ],
            [
                'receiptID' => '1018',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1018'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-06-01',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΙΟΥΝΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-06-01 19:00:00'

            ],
            [
                'receiptID' => '1019',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1019'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-07-02',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΙΟΥΛΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-07-02 19:00:00'

            ],
            [
                'receiptID' => '1020',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1020'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-08-02',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΑΥΓΟΥΣΤΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-08-02 19:00:00'

            ],
            [
                'receiptID' => '1021',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1021'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-09-02',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΣΕΠΤΕΜΒΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-09-02 19:00:00'

            ],
            [
                'receiptID' => '1022',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1022'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-10-04',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΟΚΤΩΒΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-10-04 19:00:00'

            ],
            [
                'receiptID' => '1023',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1023'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-11-01',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΝΟΕΜΒΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-11-01 19:00:00'

            ],
            [
                'receiptID' => '1024',
                'hashID' =>  Str::substr(Str::slug(Hash::make('1024'.'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ')), 0, 32),
                'seira' => '',
                'price' => '3.10',
                'date' => '2021-12-01',
                'service' => 'ΕΞΟΦΛΗΣΗ ΕΚΔΟΣΗΣ ΚΟΙΝΟΧΡΗΣΤΩΝ ΔΑΠΑΝΩΝ ΜΗΝΟΣ ΔΕΚΕΜΒΡΙΟΥ ΠΟΛΥΚΑΤΟΙΚΙΑΣ ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'client' => 'ΔΙΑΧΕΙΡΙΣΤΗ',
                'job' => '',
                'place' => 'ΑΘΗΝΑ',
                'type' => 'ΑΠΟΔΕΙΞΗ ΕΙΣΠΡΑΞΗΣ',
                'address' => 'ΜΕΝΕΜΕΝΗΣ 4, Ν.ΙΩΝΙΑ',
                'created_at' => '2021-12-01 19:00:00'

            ]
        ];
        Receipts::insert($receipts);
    }
}
